Инвентаризация_IT/src/Catalogs/Принтеры/Принтеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Принтеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипыПодключенияПринтеров</types>
    </type>
  </attributes>
  <attributes>
    <name>IPАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодельКартриджа</name>
    <type>
      <types>CatalogRef.Картриджи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/Принтеры/Forms/ФормаЭлемента/Module.bsl
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьЗначениеПеречисления(ИмяПеречисления, ИмяЗначения)
  // Возвращаем значение перечисления
  Возврат Перечисления[ИмяПеречисления][ИмяЗначения];
КонецФункции

//@skip-check module-structure-method-in-regions
&НаСервере
Процедура УстановитьВидимостьРеквизитов()
  // Получаем значение перечисления "TCP/IP" с сервера
  ЗначениеTCPIP = ПолучитьЗначениеПеречисления("ТипыПодключенияПринтеров", "TCP_IP");

  // Проверяем тип подключения
  Если Объект.ТипПодключения = ЗначениеTCPIP Тогда
    Элементы.IPАдрес.Видимость = Истина;
  Иначе
    Элементы.IPАдрес.Видимость = Ложь;
  КонецЕсли;

  // Проверяем вид оборудования
  Если Объект.ВидыОборудования = Справочники.ВидыОборудования.Принтер Тогда
    Элементы.МодельКартриджа.Видимость = Истина;
  Иначе
    Элементы.МодельКартриджа.Видимость = Ложь;
  КонецЕсли;
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
  УстановитьВидимостьРеквизитов();
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
  УстановитьВидимостьРеквизитов()
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПриОткрытии(Отказ)
  УстановитьВидимостьРеквизитов()
КонецПроцедуры
